Revit 2027 API
IFCFamilyInstanceExtrusionExportResults.MaterialId Property
 The best material id determined for the family instance.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId MaterialId { get; }
Public ReadOnly Property MaterialId As ElementId
	Get
public:
property ElementId^ MaterialId {
	ElementId^ get ();
}
member MaterialId : ElementId with get
Property Value
ElementId
See Also
Reference
IFCFamilyInstanceExtrusionExportResults Class
Autodesk.Revit.DB.IFC Namespace